readme.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-12-23 Fri 13:43 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Host Computer Instructions for "GendyCloud"</title>
<meta name="author" content="Serkan Sevilgen" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Host Computer Instructions for "GendyCloud"</h1>

<div id="outline-container-org161438c" class="outline-2">
<h2 id="org161438c"><span class="section-number-2">1.</span> Installation of Required Softwre (MACOS)</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org6b9f0cb" class="outline-3">
<h3 id="org6b9f0cb"><span class="section-number-3">1.1.</span> Install Homebrew</h3>
<div class="outline-text-3" id="text-1-1">
<div class="org-src-container">
<pre class="src src-bash">/bin/bash -c <span style="color: #8abeb7;">"$(curl -fsSL https://raw.githubusercontent.com/Homebrew/install/HEAD/install.sh)"</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org57d53eb" class="outline-3">
<h3 id="org57d53eb"><span class="section-number-3">1.2.</span> Install Csound</h3>
<div class="outline-text-3" id="text-1-2">
</div>
<div id="outline-container-org290a51b" class="outline-4">
<h4 id="org290a51b"><span class="section-number-4">1.2.1.</span> With Homebrew</h4>
<div class="outline-text-4" id="text-1-2-1">
<div class="org-src-container">
<pre class="src src-bash">brew install csound
</pre>
</div>
</div>
</div>
<div id="outline-container-org69fe0c6" class="outline-4">
<h4 id="org69fe0c6"><span class="section-number-4">1.2.2.</span> With package manager</h4>
<div class="outline-text-4" id="text-1-2-2">
<p>
<a href="https://csound.com/download.html">https://csound.com/download.html</a>
</p>
</div>
</div>

<div id="outline-container-org3041e45" class="outline-4">
<h4 id="org3041e45"><span class="section-number-4">1.2.3.</span> Check Csound version (6.18) (terminal)</h4>
<div class="outline-text-4" id="text-1-2-3">
<div class="org-src-container">
<pre class="src src-bash">csound --version
</pre>
</div>
</div>
</div>
<div id="outline-container-org9503f40" class="outline-4">
<h4 id="org9503f40"><span class="section-number-4">1.2.4.</span> Test Csound</h4>
<div class="outline-text-4" id="text-1-2-4">
</div>
<ol class="org-ol">
<li><a id="orgf3c8493"></a>Save following as csd-test.csd in the same folder<br />
<div class="outline-text-5" id="text-1-2-4-1">
<div class="org-src-container">
<pre class="src src-csound"><span style="color: #b5bd68;">&lt;CsoundSynthesizer&gt;</span>
<span style="color: #b5bd68;">&lt;CsOptions&gt;</span>
-odac
<span style="color: #b5bd68;">&lt;/CsOptions&gt;</span>
<span style="color: #b5bd68;">&lt;CsInstruments&gt;</span>
<span style="color: #b294bb;">instr</span> 1
 <span style="color: #81a2be;">aSin</span>  <span style="color: #b294bb;">poscil</span>  <span style="color: #b294bb;">0dbfs</span>/4, 440
       <span style="color: #b294bb;">out</span>     <span style="color: #81a2be;">aSin</span>
<span style="color: #b294bb;">endin</span>
<span style="color: #b5bd68;">&lt;/CsInstruments&gt;</span>
<span style="color: #b5bd68;">&lt;CsScore&gt;</span>
<span style="color: #f0c674;">i</span> 1 0 5
<span style="color: #b5bd68;">&lt;/CsScore&gt;</span>
<span style="color: #b5bd68;">&lt;/CsoundSynthesizer&gt;</span>
</pre>
</div>
</div>
</li>

<li><a id="org20d01c3"></a>Test Csound<br />
<div class="outline-text-5" id="text-1-2-4-2">
<p>
You should hear a tone for 5 seconds.
</p>
<div class="org-src-container">
<pre class="src src-csound">csound csd-test.csd
</pre>
</div>
</div>
</li>
</ol>
</div>
</div>

<div id="outline-container-orgeb628b0" class="outline-3">
<h3 id="orgeb628b0"><span class="section-number-3">1.3.</span> Download and Install NodeJS</h3>
<div class="outline-text-3" id="text-1-3">
<p>
<a href="https://nodejs.org/dist/v18.12.1/node-v18.12.1.pkg">https://nodejs.org/dist/v18.12.1/node-v18.12.1.pkg</a>
</p>

<p>
(or the latest from <a href="https://nodejs.org">https://nodejs.org</a> )
</p>
</div>
</div>

<div id="outline-container-org76593de" class="outline-3">
<h3 id="org76593de"><span class="section-number-3">1.4.</span> Remote OSC</h3>
<div class="outline-text-3" id="text-1-4">
<p>
<i>If your folder includes remote-osc/client, skip this step</i>
</p>

<p>
<a href="https://github.com/serkansevilgen/remote-osc/archive/refs/heads/master.zip">https://github.com/serkansevilgen/remote-osc/archive/refs/heads/master.zip</a>
</p>

<p>
Extract zip and go to folder client/ and run 
</p>

<div class="org-src-container">
<pre class="src src-bash">npm install
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgbb66268" class="outline-2">
<h2 id="orgbb66268"><span class="section-number-2">2.</span> Running software</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org3ffcb63" class="outline-3">
<h3 id="org3ffcb63"><span class="section-number-3">2.1.</span> Csound</h3>
<div class="outline-text-3" id="text-2-1">
<div class="org-src-container">
<pre class="src src-bash">csound xnpm22.csd
</pre>
</div>

<p>
Please keep <i>settings.csd</i> file in the same folder
</p>
</div>
</div>

<div id="outline-container-orge56d639" class="outline-3">
<h3 id="orge56d639"><span class="section-number-3">2.2.</span> Remote OSC Client</h3>
<div class="outline-text-3" id="text-2-2">
<div class="org-src-container">
<pre class="src src-bash"><span style="color: #b294bb;">cd</span> remote-osc/client
node client.js ./config.json
</pre>
</div>

<p>
The config.json file should include the following
</p>

<div class="org-src-container">
<pre class="src src-json">{
    <span style="color: #b5bd68;">"serverAddress"</span>: <span style="color: #8abeb7;">"3.125.90.128"</span>,
    <span style="color: #b5bd68;">"serverPort"</span>: <span style="color: #81a2be;">8081</span>,
    <span style="color: #b5bd68;">"clientAddress"</span>: <span style="color: #8abeb7;">"0.0.0.0"</span>,
    <span style="color: #b5bd68;">"clientPort"</span>: <span style="color: #81a2be;">1337</span>,
    <span style="color: #b5bd68;">"appAddress"</span>: <span style="color: #8abeb7;">"127.0.0.1"</span>,
    <span style="color: #b5bd68;">"appPort"</span>: <span style="color: #81a2be;">7770</span>
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org9d26fb8" class="outline-3">
<h3 id="org9d26fb8"><span class="section-number-3">2.3.</span> Web UI</h3>
<div class="outline-text-3" id="text-2-3">
<ul class="org-ul">
<li>Go to link</li>
</ul>
<p>
<a href="http://xnpm22.serkansevilgen.com/">http://xnpm22.serkansevilgen.com/</a>
</p>

<p>
network: /xnpm22
ID: 0 (0 to 7)
Name: Your name
</p>

<p>
See "Performance Notes" page
<a href="http://xnpm22.serkansevilgen.com/user-guide.html">http://xnpm22.serkansevilgen.com/user-guide.html</a>
</p>
</div>
</div>
</div>

<div id="outline-container-orga079bfc" class="outline-2">
<h2 id="orga079bfc"><span class="section-number-2">3.</span> Performance monitoring and debugging</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-org7297930" class="outline-3">
<h3 id="org7297930"><span class="section-number-3">3.1.</span> You should see the content of the config.json when you start Remote OSC client.</h3>
</div>
<div id="outline-container-orgfc8e0cf" class="outline-3">
<h3 id="orgfc8e0cf"><span class="section-number-3">3.2.</span> Whenever a performer sends data you should see it in Remote OSC client terminal like</h3>
<div class="outline-text-3" id="text-3-2">
<div class="org-src-container">
<pre class="src src-json">{
  address: '/xnpm<span style="color: #81a2be;">22</span>',
  args: [
    { type: 'i', value: <span style="color: #81a2be;">5</span> },
    { type: 's', value: 'note_dur' },
    { type: 'f', value:  <span style="color: #81a2be;">13</span>},
    { type: 's', value:  'Serkan Sevilgen}
  ]
}
</pre>
</div>
<p>
The first value is userid (5), the second is the name of the parameter (note_dur) and its value (13). The last value is your name.
</p>
</div>
</div>
<div id="outline-container-orgbe2b094" class="outline-3">
<h3 id="orgbe2b094"><span class="section-number-3">3.3.</span> If you don't see the your actions on the Web Interface reflected at the Remote-OSC display, reload Web UI.</h3>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Serkan Sevilgen</p>
<p class="date">Created: 2022-12-23 Fri 13:43</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
